Of course, in our dataset we only have one column. Try creating a dataframe and computing summary statistics using the dataset in  Listing 4-6.

In [11]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99] 
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]
StudentInfo=zip(names,grades,bsdegrees,msdegrees,phddegrees)
df=pd.DataFrame(data=StudentInfo,columns=['names','grades','bsdegrees','msdegrees','phddegrees'])
df.head()

     names  grades  bsdegrees  msdegrees  phddegrees
0      Bob      76          1          2           0
1  Jessica      95          1          1           1
2     Mary      77          0          0           0
3     John      78          0          0           0
4      Mel      99          1          0           0

In [6]:
df.describe()

          grades  bsdegrees  msdegrees  phddegrees
count   5.000000   5.000000   5.000000    5.000000
mean   85.000000   0.600000   0.600000    0.200000
std    11.067972   0.547723   0.894427    0.447214
min    76.000000   0.000000   0.000000    0.000000
25%    77.000000   0.000000   0.000000    0.000000
50%    78.000000   1.000000   0.000000    0.000000
75%    95.000000   1.000000   1.000000    0.000000
max    99.000000   1.000000   2.000000    1.000000

In [8]:
df.median()

grades        78.0
bsdegrees      1.0
msdegrees      0.0
phddegrees     0.0
dtype: float64

In [9]:
df.mode()

     names  grades  bsdegrees  msdegrees  phddegrees
0      Bob      76        1.0        0.0         0.0
1  Jessica      77        NaN        NaN         NaN
2     John      78        NaN        NaN         NaN
3     Mary      95        NaN        NaN         NaN
4      Mel      99        NaN        NaN         NaN

In [10]:
df.var()

grades        122.5
bsdegrees       0.3
msdegrees       0.8
phddegrees      0.2
dtype: float64